[Obj_Spln]
btn_xViewCheckerVerts=Показывать задвоенные группы вершин, расстояния между которыми меньше выбранного порогового значения | Shows doubled and more groups of verts, which have distances less then selected treshold
btn_xViewCheckerFaces=Показывать задвоенные группы граней, расстояние между которыми меньше выбранного порогового значения | Shows doubled and more groups of faces, which have distances less then selected treshold
chk_autoupdate=Автообновление XView, установите флажок, чтобы предотвратить автоматическое обновление на больших моделях | Auto update xView, check off to prevent auto update on huge models
btn_xViewDisable=Отключить все процедуры XView | Disables all xView procedures
btn_xViewSelect=LMB: Выбрать текущие грани или вершины с обнаруженными ошибками и показать количество ::::RMB: Скрыть невыбранные грани или вершины. Нажмите Unhide All, чтобы отобразить всё обратно | LMB: Selects current founded errored faces or verts and shows count::::RMB: Hide unselected faces or verts. Press Unhide All to show all back
btn_FindFaces=Устаревшее::LMB: Поиск граней, расположенных очень близко друг к другу, вблизи отметки 0,005м::LMB+CTRL: Поиск копланарных (не перекрывающихся) граней в диапазоне [0,005-0,02]::LMB+ALT: Поиск по всем вершинам, длиннее | Obsolete::LMB: Find very close to each other faces near treshhold 0.005m::LMB+CTRL: Find coplanar (none overlapping) faces in range [0.005-0.02]::LMB+ALT: Find by all vertices, longer
spn_Tresh_xViewChecker=Максимальный диапазон задвоек для XView, обычно [0.0 - 0.002] | Maximum of Range of doubles for XView, usually [0.0 - 0.002]
btn_VertexWeld=LMB: Попытка сварить вершины в пределах порога, если они существуют, показать их. Модификатор VertexWeld не применяется, это только для отображения ошибок::::RMB: Применить модификатор VertexWeld с текущим порогом treshold | LMB: Try to weld vertices with treshold, if they exist - show them. The modifier VertexWeld do not applies, this only for showing errors::::RMB: apply modifier VertexWeld with treshold
btn_MoveFaces=LMB: Раздвинуть все или выбранные задвоенные грани на желаемое расстояние. Нормали граней - направление сдвига::LMB+CTRL: Только выбрать::LMB+ALT: Использовать нормали вершин вместо нормалей граней::LMB+SHIFT: Двигать элементы целиком::RMB: Другой метод | LMB: Find and move coplanar dual faces in current range to desired distance::LMB+CTRL: Select only::LMB+ALT: Use verts normals instead of face normals::LMB+SHIFT: Move while elements::RMB: alternative method
btn_MoveEdges=LMB: Раздвинуть все или выбранные задвоенные ребра на желаемое расстояние. Учитываются нормали вершин элемента для направления сдвига::LMB+CTRL: Только выбрать::LMB+ALT: Сдвигать только близкие вершины, а не ребра целиком | LMB: Move the selected doubled edges to the desired distance::LMB+CTRL: Select only::LMB+ALT: Move only the nearby vertices, not the entire edges
btn_MoveVerts=LMB: Раздвинуть все или выбранные задвоенные вершины на желаемое расстояние. Учитываются нормали вершин для направления сдвига::LMB+CTRL: Только выбрать::LMB+ALT: Вектора из задвоенных вершин вместо нормалей вершин::RMB: Другой метод | LMB: Find and move dual verts::LMB+CTRL: Select only::RMB+ALT: Use dual verts as vector instead of using verts normals
btn_MoveXView=LMB: Раздвинуть найденные xView задвоенные вершины или грани на желаемое расстояние (следует выбрать текущий режим xView) | LMB: Move the duplicated vertices and faces found by xView to the desired distance
btn_DoubleFaces=Выделить элементы одной половины из набора двойных граней, нужно для Flora преобразования ВПМ в НПМ | To select elements from one half of a set of double faces, needful for Flora to convert HighPoly to Lowpoly models
btn_View_Normals=LMB: Просмотр нормалей в окне проекций. Синий - передняя сторона полигонов - правильно, оранжевый - задняя сторона полигонов - неправильно::CTRL+LMB: цвета - зеленый и синий::ALT+LMB: цвета - серый и синий::::Нажать еще раз - вернуть просмотр обратно | LMB: View normals in viewport by assigning a new double-sided material. Blue - the front side of the polygons - correct, orange - the back side of the polygons - incorrect::CTRL+LMB: alternate colors - green and blue::ALT+LMB: alternate colors - gray and blue::::Click again to return the usual view back
btn_FlipFaces=Найти копланарные грани c нормалями смотрящими друг на друга и направить их в противоположные стороны | Find coplanar faces with wrong normals and direct them in opposite sides
btn_UnhideVertsFaces2=Отобразить все скрытые части объекта EDITABLE POLY и после UVW_Unwrap | Unhide all hidden parts of EDITABLE POLY object and after UVW_Unwrap
chk_MoveFacesEdgesVerts_acuracy=Использовать высокую точность (поиск по дополнительным вершинам, к центрам граней), потребуется больше времени | Use high accuracy (search with verts positions additional to face centers), need more time
chk_MoveFacesEdgesVerts_bidirectional=Искать ТОЛЬКО с противоположно направленными гранями, наложенными друг на друга или разделенными, как заборы, стекла, деревья | Find ONLY with opposite directional faces, overlapped inside each other or pared like fences, glasses, trees
chk_MoveFacesEdgesVerts_codirectional=Искать ТОЛЬКО с сонаправленными гранями, близкими копланарными гранями с одинаковыми нормалями | Find ONLY with co-directional faces, near coplanar faces with same normals
spn_MoveFacesEdgesVerts_angle=Угол, близкий к параллельности | Angle of near parallelism
spn_MoveFacesEdgesVerts_distance=Расстояние, на которое необходимо переместить | Distance to be moved
ddl_MoveFacesEdgesVerts_range=Искать в диапазоне:::[0,0 - 0,002] подходит для двойных граней и вершин:: [0,0 - 0,005] подходит для почти копланарных граней ::[0,005 - 0,02] подходит для копланарных граней с противоположными нормалями::[0,01 - 0,02] подходит для моделей UCX::Другие диапазоны только для целей тестирования::Все методы определяют расстояние от одной грани до другой вслепую, поэтому используйте большие диапазоны с выбранными и отсоединенными в отдельный объект, поскольку они могут быть смещены из-за неизвестных ошибок при тестировании расстояния | Find in range:::[0.0 - 0.002] suitable for dual faces and verts::[0.0 - 0.005] suitable for near coplanar faces::[0.005 - 0.02] suitable for coplanar faces with opposite normals::[0.01 - 0.02] suitable for UCX models::::Other ranges for tests purpose only.::::All methods just find the distance from one face to another blindly, so use large ranges with selected and detached isolated faces, overwise they may be moved out due unknown errors distance tests
btn_TriangulateRight=LMB: Аналог кнопки Connect всех вершин в EDITABLE POLY, но работает не создавая наложенных ребер::RMB: Проверить триангуляцию выбранного объекта | LMB: Analog of All-vertices Connect button in Editable poly, but working better, do not produce overlayed edges::RMB: Check Triangulation of selected object
btn_TurnToPoly=Модификатор TurnToPoly - может приводить к ошибкам | 3ds max TurnToPoly modifier - may couse errors 
btn_ConnectVerts=Модификатор Verts Connect - может приводить к ошибкам | 3ds max Verts Connect modifier - may couse errors 
btn_RemoveErrEdges=LMB: Удалить ребра с наложенными ребрами::CTRL+LMB: Только выбрать | LMB: Try to remove errored-overlayed edges::CTRL+LMB: only select	
btn_RemoveVerts=Удалить вершины с ошибками (после модификаторов Slice и ShapeMerge). Это копия кнопки из свитка Slicers. Смотрите дополнительные опции по RMB и treshold | Try to Remove two-edged error vertices::(after Slice and ShapeMerge modifiers)::This is the copy of button from Slicers Rollout::See there for more options by RMB and treshold
btn_TargetWeld=Сварить выбранные вершины к другим на ближайших расстояниях | Welds selected vertexes with nearest distance
btn_EdgeWeld=Сварить все наложенные ребра в выделенных моделях, работает также только на выделении ребер | Weld all overlayed edges in selected objects, also work only on selected edges	
btn_ResetXform=Модификатор ResetXform | 3ds max ResetXform modifier
btn_DetachFaces=Отсоединить все элементы, чтобы разделить EDITABLE POLY объекты | Detach all elements to separate objects EDITABLE POLY
btn_Detriangulate=LMB: Детриангулировать выбранные объекты, только выбранные грани в них::LMB+CTRL: Только выбрать триангулированные ребра::LMB+Alt: Выбор не триангулированных ребер | LMB: Detriangulate Selection of objects, only selected faces in objects::LMB+CTRL: Only select triangulated edges::LMB+Alt: Select none triangulated edges
chk_DetriangulateSel=Выбрать не триангулированные ребра | Select none triangulated edges
chk_DetriangulateUV=Не детриангулировать ребра, которые находятся в разных UV-островах | Do not detriangulate edge which in different UV islands 
chk_DetriangulateSM=Не детриангулировать ребра, которые находятся на границах разных групп сглаживания | Do not detriangulate edge which on border of different Smoothing Groups
chk_DetriangulateDisputed=Не детриангулировать ребра в спорных местах | Do not detriangulate edges in Disputed places
chk_DetriangulateAn=Не детриангулировать ребра с углом между соседними гранями меньше выбранного порогового значения | Do not detriangulate edges with angle between neighbour faces less then choosen treshold
spn_DetriangulateAngle=Угол между соседними гранями | Angle between neighbour faces
btn_Autosmooth=LMB: Автоматическое сглаживание выбранных объектов по выбранному углу::RMB: Очистка всех групп сглаживания выбранных объектов | LMB: Autosmooth selected objects by selected angle::RMB: Clear all smoothing groups of selected objects
spn_AutosmoothAngle=Угол между соседними гранями | Angle between neighbour faces
btn_DeleteIso=Удалить изолированные вершины и мертвые структуры во всех выбранных объектах, объекты будут переведены в Editable Poly | Delete isolated verts and dead structs in all selected objects, will be collapsed to Editable Poly objects
btn_select_Outer_edges=Выбрать ребра, лежащие по периметру объекта | Select object edges laying by perimeter of object
chk_ignoreHardEdges=Игнорировать жесткие ребра (ребра разных групп сглаживания) | Ignore Hard edges (edges on different smoothing groups)
chk_ignoreOpenEdges=Игнорировать открытые ребра | Ignore Open edges
btn_Projection=LMB: Спроецировать выбранные объекты на поверхность базового объекта по оси Z::LMB+CTRL: Создать новую поверхность из базового объекта::::RMB: Пометить объект как базовый::RMB+CTRL: Вытянуть границы в стороны и пометить объект как базовый | LMB: Project selected objects to surface of base object by Z-Axis::LMB+CTRL: Create new surface from baseobject for projection::::RMB: Mark selected object as baseobject::RMB+CTRL: for selected object extrude edges as padding edges and set it as baseobject
